[
	{
		"name": "Dr. Narendra Shekokar",
		"pic": "../../images/Faculty/narendra_shekokar.jpeg",
		"text": "It started as an initiative by 5 students who took inspiration from a model implemented by IIT Kharagpur, Initially it started as a smaller and unofficial group but soon gained popularity amongst students and became an official DJ committee. I am extremely happy with the progress of the committee and the outcome is excellent.In the future I hope DJ Unicode would also contribute for the greater good of the society. My best wishes are with them."
	},
	{
		"name": "Pranit Bari",
		"pic": "../../images/Faculty/pranit_bari.jpg",
		"text": "Unicode was started for the purpose of student development. As Unicode is an amalgamation of BEs, TEs and SEs, it aids in senior-junior interaction. Additionally Unicode students develop team management skills. From the organization point of view, we ask the students to develop useful projects like Attendance app, Student Information Portal etc."
	},
	{
		"name": "Chetashri Bhadane",
		"pic": "../../images/Faculty/chetashri_bhadane.jpg",
		"text": "The attendance system is extremely innovative as it prevents duplication of attendance. The features of the student being able to track the previous attendance is very helpful. Unicode enables the students to solve real world problems while working in a corporate structure."
	},
	{
		"name": "Pankaj Sonawane",
		"pic": "../../images/Faculty/pankaj_sonawane.jpg",
		"text": "Unicode is a committee that has evolved tech-enthusiasts in the department and has given many students a platform to put their technical skills to use. The projects developed by them are being used by the college and is useful in solving real world problems.I wish the best of luck to Unicode for their future endeavours."
	},
	{
		"name": "Priya Lande",
		"pic": "../../images/Faculty/Priya_lande.jpeg",
		"text": "It started as an initiative by 5 students who took inspiration from a model implemented by IIT Kharagpur, Initially it started as a smaller and unofficial group but soon gained popularity amongst students and became an official DJ committee. I am extremely happy with the progress of the committee and the outcome is excellent.In the future I hope DJ Unicode would also contribute for the greater good of the society. My best wishes are with them."
	}
]