[
	{
		"title": "SPA Project",
		"desc": "Computer Programming Exam Portal is a centralized system designed for teachers to assuage the wearisome task of evaluating C programs manually\r\n\r\n> This portal is the panacea for all the tedious tasks involved in paper\r\n> correction. It offers all the facilities required for creation of\r\n> test, testing taking and evaluation of the tests. This application\r\n> seeks to circumvent the traditional process of manual evaluation of C\r\n> programs.\r\n\r\nThe several features offered by the portal are listed below\r\n\r\n**Features**\r\n\r\n - Real time code compilation\r\n - Automatic generation of student reports\r\n - Easy test creation methods\r\n - Automatic evaluation for MCQs\r\n\r\nWe have created a user-level authentication and registration that allows teachers to conduct SPA examinations online. It allows the teachers to create customized tests consisting of coding problems and multiple-choice questions. It allows the students to compile their coding responses in real time during the test and thus, enabling the teachers to see the compiled version of the student’s code.\r\n\r\nThen the teachers can review the responses and grade the student based on the output generated without having to check for any syntax errors or logical errors made by the student. Moreover, the mcq section is evaluated automatically. The portal also generates and sends a report for each student via email and maintains a record of all students in an excel sheet.\r\n\r\n[Demo](https://www.youtube.com/watch?v=kn7lwJoYfuU)",
		"slug": "spa-project",
		"img_cover": "/media/projects/2020/05/13/CreateTest.png",
		"img": [
			"/media/projects/2020/05/13/evaluate.png",
			"/media/projects/2020/05/13/teacherLogin.png",
			"/media/projects/2020/05/13/Test_CODE.png",
			"/media/projects/2020/05/13/Test_MCQ.png",
			"/media/projects/2020/05/13/ViewTest.png"
		],
		"stack": [
			"MongoDB",
			" ExpressJs",
			" React",
			" NodeJs"
		],
		"tech": [
			"web"
		],
		"contributors": {
			"BEmentors": [],
			"TEmentors": [
				26,
				30,
				38
			],
			"SEmentees": [
				1,
				15,
				42,
				51
			]
		},
		"year": "2019-07-01",
		"links": [
			"https://github.com/djunicode"
		]
	},
	{
		"title": "Canteen Automation Web",
		"desc": "DJ Canteen is a zomato-like application for DJSCE which allows users to place orders using an android app and the canteen manager gets real-time updates about orders in queue. The motivation of the app was to reduce the queues at the canteen and allow people to order from anywhere in college.\r\n\r\nThe dashboard is made using React and Bootstrap. The backend is built with Django, REST framework, and Graphene. The manager-side dashboard is updated in real-time so that no order is missed. The dashboard also allows for editing the canteen menu, which is visible in the user-side app.",
		"slug": "canteen-automation-web",
		"img_cover": "/media/projects/2020/05/14/event.jpeg",
		"img": [
			"/media/projects/2020/05/14/event1.jpeg",
			"/media/projects/2020/05/14/event2.jpeg"
		],
		"stack": [
			"React",
			" Django",
			" DjangoRestFramework"
		],
		"tech": [
			"web"
		],
		"contributors": {
			"BEmentors": [
				58
			],
			"TEmentors": [
				20,
				24,
				30,
				36,
				38
			],
			"SEmentees": [
				1,
				12,
				15,
				40,
				48,
				49
			]
		},
		"year": "2019-07-01",
		"links": [
			"https://github.com/djunicode/canteen-automation-web"
		]
	},
	{
		"title": "Unicode Website",
		"desc": "The unicode website is the official website of the student community of DJ Unicode. It is a one stop portal to learn about all the projects, the people, the events and the organization. The website is aimed at driving and attracting visibility towards the organization to add to the great work that is put in by the students. \r\n\r\nThe website has many features such as the blog page, project pages, event schedules, and student information. The blog pages feature the blogs written by the students about the various resources and experiences available as a student developer. The project page is a collection of all the projects that are undertaken at Unicode every year. The event page is used to inform the users for all the events that Unicode hosts and they can book and confirm their spot right here. In order to increase the visibility, Unicode Website also features all the member students of the team who work on various projects. One can contact the organization using the Contact Us page and also subscribe to the newsletters.",
		"slug": "unicode-website",
		"img_cover": "/media/projects/2020/05/13/1.png",
		"img": [
			"/media/projects/2020/05/13/2.png",
			"/media/projects/2020/05/13/3.png",
			"/media/projects/2020/05/13/5.png",
			"/media/projects/2020/05/13/7.png"
		],
		"stack": [
			"React",
			" Django",
			" DjangoRestFramework"
		],
		"tech": [
			"web"
		],
		"contributors": {
			"BEmentors": [],
			"TEmentors": [
				2,
				4,
				5,
				20
			],
			"SEmentees": [
				1,
				3,
				44,
				47,
				51
			]
		},
		"year": "2019-07-01",
		"links": [
			"https://github.com/djunicode/unicode-website"
		]
	},
	{
		"title": "Attendance Web",
		"desc": "Teachers need to formulate multiple reports recording attendance, and since most of it is manual entry, an automated system makes it easy for teachers to minimize the effort in making defaulters records.\r\n\r\n> We use Multiple teachers for each subject, an automated entry based system that checks the time and day, a class teacher who has have higher permission than a subject teacher, in all other classes where she is merely a subject teacher, she should not have the elevated privileges.\r\n\r\n## Features\r\nIn this application we have included three types of users a superuser, teachers and class teachers,view and edit attendance wherein view - The attendance subject wise can be viewed and edit which based on time and day of lecture can be edited. The CSVs of the attendance can be downloaded from the web-app. A Defaulters list of the concerning students is also generated.The subject wise overall attendance for class teacher is also displayed.",
		"slug": "attendance-web",
		"img_cover": "/media/projects/2019/09/25/Why-attendance-marks-are-unfair_Khyati-667x400.jpg",
		"img": [
			"/media/projects/2019/09/23/edit.png",
			"/media/projects/2019/09/23/view_atten.png"
		],
		"stack": [
			"React",
			" Django",
			" DjangoRestFramework",
			" MySQL"
		],
		"tech": [
			"web"
		],
		"contributors": {
			"BEmentors": [
				6
			],
			"TEmentors": [
				7,
				32
			],
			"SEmentees": [
				9,
				14,
				35,
				39,
				46
			]
		},
		"year": "2018-10-01",
		"links": [
			"https://github.com/djunicode/Attendance-System-Web"
		]
	},
	{
		"title": "Event Management System",
		"desc": "Teachers need to formulate multiple reports for events, and since most of it is paper work and there is no safety of records, an automated system makes it easy for teachers.\r\n\r\n> We have creates a system that allows event report generation, automatic report emailing to concerned authorities and editing of the report with limited access\r\n\r\n## Features\r\nIn this web app we have included three types of users - Superuser, Teachers and Vice-Principal who have different levels of access depending upon the usage. View and edit report where in view, the event report generated can be viewed and edit which is based on change in venue or date and time. We have also allowed a provision to download CSVs from the web-app. The web app also generates a monthly event list.",
		"slug": "event-management-system",
		"img_cover": "/media/projects/2019/09/25/Event_cover.png",
		"img": [
			"/media/projects/2019/09/24/Screenshot_2019-09-17_at_12.47.12_PM.png",
			"/media/projects/2019/09/24/Screenshot_2019-09-17_at_12.48.12_PM.png",
			"/media/projects/2019/09/24/Screenshot_2019-09-17_at_12.48.54_PM.png"
		],
		"stack": [
			"React",
			" Django",
			" DjangoRestFramework",
			" MySQL"
		],
		"tech": [
			"web"
		],
		"contributors": {
			"BEmentors": [],
			"TEmentors": [],
			"SEmentees": [
				8,
				15,
				39,
				40,
				42,
				45,
				49,
				56
			]
		},
		"year": "2018-10-01",
		"links": [
			"https://github.com/squirtle-skwad/college-event-manager"
		]
	},
	{
		"title": "Attendance App",
		"desc": "Teachers need to formulate multiple reports recording attendance, and since most of it is manual entry, an automated system makes it easy for teachers to minimize the effort in making defaulters records.\r\n\r\n> We use Multiple teachers for each subject, an automated entry based system that checks the time and day, a class teacher who has have higher permission than a subject teacher, in all other classes where she is merely a subject teacher, she should not have the elevated privileges.\r\n\r\n## Features\r\nIn this application we have included three types of users a superuser, teachers and class teachers,view and edit attendance wherein view - The attendance subject wise can be viewed and edit which based on time and day of lecture can be edited. The CSVs of the attendance can be downloaded from the web-app. A Defaulters list of the concerning students is also generated.The subject wise overall attendance for class teacher is also displayed.",
		"slug": "attendance-app",
		"img_cover": "/media/projects/2020/05/26/Login.png",
		"img": [
			"/media/projects/2020/05/26/StudentHome.jpg",
			"/media/projects/2020/05/26/StudentList.jpg",
			"/media/projects/2020/05/26/TeacherForm.png",
			"/media/projects/2020/05/26/TeacherHome.png",
			"/media/projects/2020/05/26/UserPage.png"
		],
		"stack": [
			"Android Java"
		],
		"tech": [
			"app"
		],
		"contributors": {
			"BEmentors": [],
			"TEmentors": [
				10,
				37
			],
			"SEmentees": [
				13,
				23,
				25
			]
		},
		"year": "2018-10-01",
		"links": [
			"https://github.com/djunicode/attendance-android-app"
		]
	},
	{
		"title": "Project Finder",
		"desc": "Often there are situations in any institution where the medium of communication between the students regarding their extra-curricular activities like open-source projects, hackathons, etc. is not strong enough. To bridge this gap, Project Finder is an application that comes in handy. It aims to help juniors identify seniors who can mentor them for a particular skill. If the senior students need help, they can work with interested junior students. The main aim of the web app is to increase the interaction between juniors and seniors. Apart from this,  This will enable the juniors to grow at a much faster rate and help them scale new heights\r\n\r\nThe need of this project is to proliferate the interaction between the juniors and seniors and get students in touch with other students sharing similar set of skills and interests.A user can upload details about a particular project and form a team regarding the same. The same goes for Hackathons, users can upload the details about the upcoming hackathon and create his/her team. The web app allows students to look for teammates for hackathons as well as their own personal projects. Using the app, junior students can know what projects their seniors are working on. A user can approach another user for various purposes. He/She can be asked by a fellow user for being his/her mentor to learn a new skill.There is a provision for professors to post their projects as well. Anyone who wishes to work on projects posted by professors can do so by creating a team for it.",
		"slug": "project-finder",
		"img": [],
		"stack": [
			"React",
			" Django",
			" DjangoRestFramework"
		],
		"tech": [
			"web"
		],
		"contributors": {
			"BEmentors": [
				55
			],
			"TEmentors": [
				28,
				37,
				57
			],
			"SEmentees": [
				8,
				56
			]
		},
		"year": "2018-08-01",
		"links": [
			"https://github.com/djunicode/Project-Finder"
		]
	},
	{
		"title": "BE Project Web",
		"desc": "BE project web aims to digitize the process of storing records of final year projects\r\nwhich are currently stored in the Black book. The web app allows final year students to upload abstracts and details of their projects. Using the app, students can know what projects their seniors have already worked on.This will enable them to select a different topic or extend the idea of the previously created project. \r\n\r\nOur projected audience are newly joined SEs, seeking ideas for mini-projects, TEs/BEs who would help juniors in their area of interest and TEs who are in the ideation phase of their final year project.We have been able to acheive features like Find a project (In-house/Outhouse), Advanced search filtering, Token-based authentication for teachers (credentials will be provided by us for the\r\nteachers), Only approved projects by the teachers will be displayed.",
		"slug": "be-project-web-1",
		"img": [],
		"stack": [
			"React",
			" Django",
			" DjangoRestFramework"
		],
		"tech": [
			"web"
		],
		"contributors": {
			"BEmentors": [],
			"TEmentors": [
				54
			],
			"SEmentees": [
				17,
				26,
				34,
				42,
				43,
				45
			]
		},
		"year": "2018-07-01",
		"links": [
			"https://github.com/djunicode/BE-Project-Web"
		]
	},
	{
		"title": "DJ Comps Android App",
		"desc": "The need for an organized cloud storage platform for DJ Comps was what\r\ngot us started.\r\nWe hence decided to create an app solution for the same.\r\nSharing and downloading resources could not have been made any easier.\r\nWe have used Android Studio and a Django Rest Framework for this\r\nproject.\r\n\r\n## Motivation\r\n\r\n* To provide a platform for students and teachers to seamlessly share documents and important notifications\r\n* For a student it’s a one stop portal for sharing all your notes, assignments & study material\r\n* For a teacher it’s a very convenient mode of communicating announcements and validating submission dates.\r\n* Avoids the clutter and confusion of a social messaging site like Whatsapp but at the same time is very fast and intuitive",
		"slug": "dj-comps-android-app-1",
		"img_cover": "/media/projects/2020/05/14/djcomps1.jpg",
		"img": [
			"/media/projects/2020/05/14/djcomps2.jpg",
			"/media/projects/2020/05/14/djcomps3.jpg",
			"/media/projects/2020/05/14/djcomps4.jpg",
			"/media/projects/2020/05/14/djcomps5.jpg",
			"/media/projects/2020/05/14/djcomps6.jpg"
		],
		"stack": [
			"Android Java"
		],
		"tech": [
			"app"
		],
		"contributors": {
			"BEmentors": [],
			"TEmentors": [],
			"SEmentees": [
				10
			]
		},
		"year": "2018-07-01",
		"links": [
			"https://github.com/djunicode/DJ-Comps-Android-App"
		]
	},
	{
		"title": "Canteen Automation App",
		"desc": "DJ Canteen is a zomato-like application for DJSCE which allows users to place orders using an android app and the canteen manager gets real-time updates about orders in queue. The motivation of the app was to reduce the queues at the canteen and allow people to order from anywhere in college.\r\n\r\nThe app is made using Java. The backend is built with Django, REST framework, and Graphene.",
		"slug": "canteen-automation-app",
		"img": [],
		"stack": [
			"Android Java"
		],
		"tech": [
			"app"
		],
		"contributors": {
			"BEmentors": [],
			"TEmentors": [],
			"SEmentees": [
				18,
				22,
				25,
				33
			]
		},
		"year": "2018-07-01",
		"links": [
			"https://github.com/djunicode/canteen-android-app"
		]
	},
	{
		"title": "Student Information Portal",
		"desc": "The Student Information Portal acts as a centralized information system which seeks to fix the constant state of information void that the department is in.\r\n\r\n> We with this application, seek to offer a one-stop-shop for all the information needs of the teachers, recruiters and the department as a whole. This application seeks to circumvent the disparate sources through which information is usually sourced in the department.\r\n\r\n The application also offers several features which allow teachers and recruiters to analyze student’s performance, skills, projects etc and search/filter for students according to their own needs. \r\n\r\n## FEATURES\r\n\r\nWe have achieved a web portal containing information of all students for use primarily by teachers, staff\r\nand potential recruiters, a response mobile-ready web interface to allow seamless action to student information, comprehensive information about Internships, Grades, Skills and Extracurricular\r\nActivities,a “What You See is What You Get” intuitive form interface to ease the updation of\r\nprofile and addition of information by students, an intelligent notifications system to allow teachers actively monitor student progress with real-time SMS notifications, option allowing students to submit proof of their achievements/internships in form of images/other files. \r\n\r\n##FUTURE SCOPE\r\nIn the future we aim to create an auto-generation of the student’s resume in pdf format based on all his academic details, achievements, internships, etc. The progress monitoring graphs could be used further to recommend students what are their strengths and weaknesses, a comparative analysis of a particular student’s academic records can be done with that\r\nof his peers and linking of students to teachers based on the subjects they teach.",
		"slug": "student-information-portal",
		"img_cover": "/media/projects/2019/09/25/45575846-9804fd80-b892-11e8-8900-614a0fca018d.png",
		"img": [
			"/media/projects/2019/09/25/45575871-a7844680-b892-11e8-9930-e73d21bc4aff.png",
			"/media/projects/2019/09/25/45575849-9b988480-b892-11e8-90e7-f8ba9a3c51d9.png",
			"/media/projects/2019/09/25/45575853-9e937500-b892-11e8-8ebb-ea0af950a127.png"
		],
		"stack": [
			"Stack 1"
		],
		"tech": [
			"web"
		],
		"contributors": {
			"BEmentors": [],
			"TEmentors": [
				6
			],
			"SEmentees": [
				38,
				57
			]
		},
		"year": "2017-12-12",
		"links": [
			"https://github.com/djunicode/DJ-Comps-Student-Info-Portal"
		]
	},
	{
		"title": "BookX",
		"desc": "Students buy books for reference or for semester exams and do not have a use for the books after a certain time duration. These books could prove to be useful for others who may have a requirement for the book.\r\n\r\n> Keeping this aim in mind we have created a book exchange web-app for the transfer and\r\nexchange of books between students within the Computer Engineering department.\r\n\r\n## FEATURES\r\nWe have created a user-level authentication and registration that allows the user to log on to the portal, book listing that allows the user to view the books that are currently available and also search for any specific book, if needed, a forum that allows easy communication between seniors and juniors, a chat portal that facilitates person to person chat and have also enabled features that resemble e-commerce sites for easy search, intuitive navigation, and swift selection of product(s).\r\n\r\n## FUTURE SCOPE\r\nWhile this platform is currently limited only to our Computer department we wish to extend it to all other departments, use of an image recognition algorithm to see whether the book image is not inappropriate, a language checker to block offensive words, integration with the Computer Department Library to open up access to a broader range of books than would otherwise be available online.",
		"slug": "bookx",
		"img_cover": "/media/projects/2019/09/25/bx_cover_I787r5q.png",
		"img": [
			"/media/projects/2019/09/25/bx_cover.png",
			"/media/projects/2019/09/24/image5.png",
			"/media/projects/2019/09/24/image6.png",
			"/media/projects/2019/09/24/image7.png",
			"/media/projects/2019/09/24/image8.png"
		],
		"stack": [
			"React",
			" Django",
			" DjangoRestFramework",
			" MySQL"
		],
		"tech": [
			"web"
		],
		"contributors": {
			"BEmentors": [],
			"TEmentors": [
				52,
				53,
				54
			],
			"SEmentees": [
				4,
				5,
				26,
				36,
				43
			]
		},
		"year": "2017-10-01",
		"links": [
			"https://github.com/djunicode/DJ-Comps-Book-Exchange"
		]
	},
	{
		"title": "DJ-Comps-Skill-Finder",
		"desc": "DJ-Comps-Skill-Finder is an application to find people with similar interests as you on the campus. The general approach of finding people with similar interests as you can be time consuming as there is a need to first talk to people and then filter the ones that are interested to work in the same domain as you. This application aims to resolve the time consuming process and rather daunting process of approaching seniors/ peers by automatically matching up people who have interests in similar domains.\r\nOur audience focuses on Newly joined SEs, seeking answers to all kinds of questions, TEs/BEs who would help juniors in their area of interest, Any student seeking team members for a project/hackathon, Any student wishing to contact students whose skills match his/her interests.\r\n\r\nUsing our application a student may request a senior to mentor him/her in a particular programming language/skill, thus finding a mentor. Match a Mentor in which a student may choose to mentor others in whichever skills he is proficient in. The student can find a team for Hackathons/Project, find team members based on skills and also post new Hackathons all on the same portal",
		"slug": "dj-comps-skill-finder",
		"img": [],
		"stack": [
			"React",
			" Django",
			" DjangoRestFramework"
		],
		"tech": [
			"web"
		],
		"contributors": {
			"BEmentors": [],
			"TEmentors": [
				58
			],
			"SEmentees": [
				2,
				7,
				20,
				27,
				28,
				30,
				55
			]
		},
		"year": "2017-07-01",
		"links": [
			"https://github.com/djunicode/DJ-Comps-Skill-Finder"
		]
	},
	{
		"title": "Queueing App",
		"desc": "To simplify and assist the teacher as well as a student during the\r\nsubmissions thereby overcoming the need for physical queues (physically\r\nbeing present in the queue) and forming virtual ones.\r\n* The app allows teachers to create future submission queues and also\r\nnotifies the student of a particular batch about the same.\r\n* Whenever a submission is started by a teacher, the students can then\r\njoin the Queue through the app and he/she is shown his/her position the\r\nQueue. This enables the student to invest that time productively until\r\nthe time is his/her turn arrives.\r\n* Students can subscribe to various teachers he/she wants to get notified\r\nabout and then whenever the teacher updates their location or creates a\r\nsubmission Queue, the student will be notified about the same.\r\n\r\n## Motivation\r\n\r\n1. The submission week tends to be tiring for both the teachers as well as\r\nstudents.\r\n2. Due to various submissions at different locations confusion is created\r\namongst the students and the teachers. Also, corridors become crowded and\r\nchaotic.\r\n3. It becomes inconvenient for the teacher to maintain discipline in the\r\nQueue and carry out submissions at the same time.\r\n4. There is wastage of time of the students who have to stand in Queue for\r\nsubmissions.\r\nTo overcome all these problems and make the submission process less tiring\r\nwe have come up with this app.",
		"slug": "queueing-app-1",
		"img_cover": "/media/projects/2020/05/14/queue1.png",
		"img": [
			"/media/projects/2020/05/14/queue2.png",
			"/media/projects/2020/05/14/queue3.png"
		],
		"stack": [
			"Android Java"
		],
		"tech": [
			"app"
		],
		"contributors": {
			"BEmentors": [],
			"TEmentors": [],
			"SEmentees": [
				18,
				33
			]
		},
		"year": "2017-07-01",
		"links": [
			"https://github.com/djunicode/QueueingApp"
		]
	}
]